-- Использование ChatGPT-4 для перевода может привести к неточностям; пожалуйста, посетите эту ссылку, чтобы внести изменения: https://github.com/sbzlzh/ttt2-role_hanfei, или свяжитесь со Steam: https://steamcommunity.com/profiles/76561198444795757/
-- Этот персонаж не атакует ни дела, ни людей, ни вещи, пожалуйста, не вовлекайтесь в это.
-- Обновлено: 28 марта 2023
local L = LANG.GetLanguageTableReference("ru")

-- GENERAL ROLE LANGUAGE STRINGS
L[HANFEI.name] = "Бандит Ближнего Востока"
L["info_popup_" .. HANFEI.name] = [[Вы - Бандит Ближнего Востока!
Не колеблясь, просто сделай это!]]
L["body_found_" .. HANFEI.abbr] = "Это Бандит Ближнего Востока!"
L["search_role_" .. HANFEI.abbr] = "Этот человек - Бандит Ближнего Востока!"
L["target_" .. HANFEI.name] = "Бандит Ближнего Востока"
L["ttt2_desc_" .. HANFEI.name] = [[Это мощный предатель!
Он начинает игру с C4, высокой броней и АК. При смерти он вызывает звуковой эффект Аллаху акбар и взрывается, нанося урон по области!]]

L["label_hanfei_armor"] = "Количество брони"
L["label_hanfei_hp"] = "Количество очков здоровья"
L["label_hanfei_exposetime"] = "Время экспозиции"
L["ttt2_hanfei_chat_reveal"] = "{playername} является Бандитом Ближнего Востока в этом раунде, давайте сбросим его вместе!"