-- Цей персонаж не атакує речі, людей чи предмети. Будь ласка, не втручайтеся.

local L = LANG.GetLanguageTableReference("uk")

-- ЗАГАЛЬНІ РЯДКИ МОВИ РОЛЕЙ
L[HANFEI.name] = "Близькосхідний бандит"
L["info_popup_" .. HANFEI.name] = [[Ви - близькосхідний бандит! Не вагайтеся, просто зробіть це!]]
L["body_found_" .. HANFEI.abbr] = "Це близькосхідний бандит!"
L["search_role_" .. HANFEI.abbr] = "Ця людина - близькосхідний бандит!"
L["target_" .. HANFEI.name] = "Близькосхідний бандит"
L["ttt2_desc_" .. HANFEI.name] = [[ Це могутній зрадник! Він починає гру з C4, високою бронею та АК. Після смерті він активує звуковий ефект "Аллах Акбар" і вибухає, завдаючи шкоди на місцевості!]]

L["label_hanfei_armor"] = "Кількість броні (Діапазон: 0-500. За замовчуванням: 50)"
L["label_hanfei_hp"] = "Кількість очок здоров'я (Діапазон: 0-500. За замовчуванням: 150)"
L["label_hanfei_exposetime_enabled"] = "Увімкнути час експозиції (0: Вимкнути 1: Увімкнути. За замовчуванням: 1)"
L["label_hanfei_exposetime"] = "Час експозиції (Діапазон: 0-120. За замовчуванням: 60 секунд)"
L["label_hanfei_tracker_mode"] = "Виберіть режим ефекту (0: Немає 1: Радар 2: Трекер)"
L["ttt2_hanfei_chat_reveal"] = "{ім'я гравця} - близькосхідний бандит цього раунду, давайте всі разом його знищимо!"
L["ttt2_hanfei_chat_explode_info"] = "Пролунав гучний вибух! Близькосхідний бандит: {ім'я гравця}"

L["tracker_not_available"] = "Middle Eastern Bandit не може отримати трекер, оскільки це спорядження недоступне на сервері. Якщо воно відсутнє, перейдіть до Required Items вашого персонажа, щоб завантажити його."
